In [1]:
import pandas as pd

In [16]:
valores = [6,8, 34, 94, 78]
indice = range(len(valores))

pd.Series(data = valores, index = indice)

0     6
1     8
2    34
3    94
4    78
dtype: int64

In [17]:
valores = [6,8, 34, 94, 78]
indice = range(len(valores))

serie1 = pd.Series(data = valores, index = indice)
serie1

0     6
1     8
2    34
3    94
4    78
dtype: int64

In [18]:
valores2 = [28, 45, 852, 3, 16]
serie2 = pd.Series(index = indice, data = valores2)
serie2

0     28
1     45
2    852
3      3
4     16
dtype: int64

In [19]:
serie1 + serie2

0     34
1     53
2    886
3     97
4     94
dtype: int64

In [20]:
serie1 ** serie2

0   -1823562080465190912
1                      0
2                      0
3                 830584
4    3945326505906733056
dtype: int64

In [21]:
34 ** (-852)

0.0

In [23]:
import numpy as np

In [25]:
array = np.random.normal(-10, 10, size = [4,4])
array

array([[  3.17846607,  -3.83842892, -12.88132272,  -6.51165528],
       [-24.61160288,   2.57657423,  -4.59663317, -16.48844063],
       [-21.97659643,   6.61660712, -21.09508896,  -4.31874616],
       [-16.34328506, -14.36081709, -12.44210664, -32.7970923 ]])

In [26]:
pd.DataFrame([[2,3],[4,5]], index = ['a', 'b'], columns = ['w', 'x'])

   w  x
a  2  3
b  4  5

In [27]:
pd.DataFrame(array)

           0          1          2          3
0   3.178466  -3.838429 -12.881323  -6.511655
1 -24.611603   2.576574  -4.596633 -16.488441
2 -21.976596   6.616607 -21.095089  -4.318746
3 -16.343285 -14.360817 -12.442107 -32.797092

In [28]:
len(array)

4

In [31]:
df = pd.DataFrame (array, index = range (1, len(array)+1), columns = ['W', 'X', 'Y', 'Z'])
df

           W          X          Y          Z
1   3.178466  -3.838429 -12.881323  -6.511655
2 -24.611603   2.576574  -4.596633 -16.488441
3 -21.976596   6.616607 -21.095089  -4.318746
4 -16.343285 -14.360817 -12.442107 -32.797092

In [32]:
type(df['X'])

pandas.core.series.Series

In [33]:
df.X

1    -3.838429
2     2.576574
3     6.616607
4   -14.360817
Name: X, dtype: float64

In [34]:
df[ ['W', 'Y'] ]

           W          Y
1   3.178466 -12.881323
2 -24.611603  -4.596633
3 -21.976596 -21.095089
4 -16.343285 -12.442107

In [36]:
df ['suma_X_Z'] = df.X +df.Z
df

           W          X          Y          Z   suma_X_Z
1   3.178466  -3.838429 -12.881323  -6.511655 -10.350084
2 -24.611603   2.576574  -4.596633 -16.488441 -13.911866
3 -21.976596   6.616607 -21.095089  -4.318746   2.297861
4 -16.343285 -14.360817 -12.442107 -32.797092 -47.157909

In [39]:
df.drop('Y', axis=1, inplace = True) # axis = 1 es para borrar columnas y axis = 0 es para borrar filas

In [40]:
df

           W          X          Z   suma_X_Z
1   3.178466  -3.838429  -6.511655 -10.350084
2 -24.611603   2.576574 -16.488441 -13.911866
3 -21.976596   6.616607  -4.318746   2.297861
4 -16.343285 -14.360817 -32.797092 -47.157909

In [41]:
df.drop(3, axis= 0)

           W          X          Z   suma_X_Z
1   3.178466  -3.838429  -6.511655 -10.350084
2 -24.611603   2.576574 -16.488441 -13.911866
4 -16.343285 -14.360817 -32.797092 -47.157909

In [42]:
df

           W          X          Z   suma_X_Z
1   3.178466  -3.838429  -6.511655 -10.350084
2 -24.611603   2.576574 -16.488441 -13.911866
3 -21.976596   6.616607  -4.318746   2.297861
4 -16.343285 -14.360817 -32.797092 -47.157909

In [43]:
df.loc[1]

W            3.178466
X           -3.838429
Z           -6.511655
suma_X_Z   -10.350084
Name: 1, dtype: float64

In [44]:
df.iloc[[0,2]]

           W         X         Z   suma_X_Z
1   3.178466 -3.838429 -6.511655 -10.350084
3 -21.976596  6.616607 -4.318746   2.297861

In [45]:
df

           W          X          Z   suma_X_Z
1   3.178466  -3.838429  -6.511655 -10.350084
2 -24.611603   2.576574 -16.488441 -13.911866
3 -21.976596   6.616607  -4.318746   2.297861
4 -16.343285 -14.360817 -32.797092 -47.157909

In [46]:
df.loc[3, 'X']

np.float64(6.6166071203073855)

In [49]:
df

           W          X          Z   suma_X_Z
1   3.178466  -3.838429  -6.511655 -10.350084
2 -24.611603   2.576574 -16.488441 -13.911866
3 -21.976596   6.616607  -4.318746   2.297861
4 -16.343285 -14.360817 -32.797092 -47.157909

In [51]:
df.loc[ [2, 4],['X', 'suma_X_Z'] ]

           X   suma_X_Z
2   2.576574 -13.911866
4 -14.360817 -47.157909